\ В данном файле описаны функции, необходимые для работы с массивами данных
\ в частности, такими массивами могут выступать строки

\ Считается, что любые массивы данных хранится в формате Pascal-строк
\ Таким образом в начале хранится количество элементов в буфере, после чего идут сами элементы

\ В файле описаны функции, позволяющие производится базовые операции с такими буферами

\ ============================================================================================================================

\ Замена адреса буфера на адрес начала его содержимого его длину
\ --------------------------------------------------------------------
\   ... addr        --->        ... addr+1 len
\ --------------------------------------------------------------------
: count
    dup                             \ Продублировали адрес
    1 +                             \ Увеличили адрес на 1
    swap                            \ Вынесли неизмененный адрес наверх
    load                            \ Загрузили длину
;

\ ============================================================================================================================

\ Увеличение размера буфера на 1
\ --------------------------------------------------------------------
\   ... addr        --->        ...
\ --------------------------------------------------------------------
: inc_buffer_len
    dup                             \ Продублировали адрес, чтобы потом по нему сохранять
    load                            \ Загрузили длину
    1 +                             \ Увеличили длину на 1
    store                           \ Сохранили новую длину
;

\ ============================================================================================================================

\ Добавление значения в конец буфера
\ --------------------------------------------------------------------
\   ... value addr        --->        ...
\ --------------------------------------------------------------------
: push_back
    dup inc_buffer_len              \ Увеличили длину буфера на 1
    dup load +                      \ Вычислили адрес для записи нового значения
    swap store                      \ Записали значение
;

\ ============================================================================================================================